app/channels/private/conversation_channel.rb

  def send_message(data)
    message_params = data['message'].each_with_object({}) do |el, hash|
      hash[el['name']] = el['value']
    end
    Private::Message.create(message_params)

    #track this on activities table
    conversation = Private::Conversation.where(id: message_params['conversation_id']).first
    @is_user_sender = message_params['user_id'].to_s == conversation.sender_id.to_s

    if @is_user_sender
        userDetails = User.where(id: conversation.recipient_id).first
---
INSERT INTO `private_messages` (`body`, `user_id`, `conversation_id`, `created_at`, `updated_at`) VALUES ('hai sa mai vedem', 2, 3, '2019-01-24 15:36:13', '2019-01-24 15:36:13')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1