app/controllers/application_controller.rb

SELECT  `private_conversations`.* FROM `private_conversations` WHERE `private_conversations`.`id` = 3 LIMIT 1
---
  def opened_conversations_windows
    if user_signed_in?
      # opened conversations
      session[:private_conversations] ||= []
      @private_conversations_windows = Private::Conversation.includes(:recipient, :messages)
                                                            .find(session[:private_conversations])