app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 ORDER BY `posts`.`created_at` DESC LIMIT 1
---
  def show
    @post = Post.find(params[:id])